Autodesk.Revit.DB.MEPSystem.Remove(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Remove elements from system.
Remarks:
It is forbidden to remove all terminal elements from system.
Terminal elements will be removed from the system automatically after removing this system from document.
elementIds: The elements to be removed from the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument elements is null, or any element in that collection is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when some of the elements can't be removed, or when trying to remove all elements from the system.
The element which connect to the base equipment can't be removed,
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the operation failed.